Revit 2027 API
BuiltInFailures.FamilyFailures.CannotChangeTypeLineBased Property
 Can't change type of "[Family Name]" from line based to non-line based or vice-versa.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotChangeTypeLineBased { get; }
Public Shared ReadOnly Property CannotChangeTypeLineBased As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotChangeTypeLineBased {
	FailureDefinitionId^ get ();
}
static member CannotChangeTypeLineBased : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace